{
  "backend/courses/course-content.mo": "Defines Course type and createCourseDatabase function that returns a Map of persistent course content for Mathematics, Science, English, Hindi, and Social Studies across grades 1-12 with details like syllabus, objectives, and pass marks.",
  "backend/main.mo": "Main actor implementing user profiles, course enrollment, fee payment system (₹500 monthly/₹4800 annual), and course query operations (getAllCourses, getCoursesBySubject, getCoursesByGrade) with authorization checks using AccessControl and MixinAuthorization.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of all frontend components, pages, hooks, and configuration files describing the React application structure with TanStack Router, authentication, course browsing, enrollment, and payment features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining colors for UI elements like background, foreground, primary, secondary, borders, and charts.",
  "frontend/index.html": "HTML entry point for the Glorious Cyber School application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for Home, Courses, CourseDetail, Dashboard, About, Enrollment, and FeePayment pages, wrapped in ThemeProvider with Layout and ProfileSetup components.",
  "frontend/src/components/CourseCard.tsx": "Reusable course card component displaying course icon, title, description, grade level, and difficulty badge with hover effects, linking to course detail page using Course type from backend.",
  "frontend/src/components/FeaturedCourses.tsx": "Component fetching and displaying up to 6 featured courses in a grid using useGetAllCourses hook, with loading state, empty state handling, and link to view all courses.",
  "frontend/src/components/Footer.tsx": "Footer component displaying school information, quick navigation links, contact details, and copyright notice with a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Responsive header component with logo, navigation menu (desktop and mobile), and authentication-aware links that show Dashboard/Enrollment/Fee Payment when logged in.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that combines Header, Footer, and children content in a flex column structure.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states and error handling for duplicate authentication.",
  "frontend/src/components/PaymentHistory.tsx": "Displays a table of payment records with status badges, payment types, amounts in INR, and formatted dates, fetched via useGetPaymentHistory hook.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name, preventing dismissal until profile setup is complete.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, enrollments, payments, courses, and fee structures using the backend actor. Includes query invalidation and toast notifications for success/error states.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes using OKLCH color space, featuring warm cream backgrounds, vibrant orange primary, and fresh green secondary colors. Includes utility classes for hero gradients and card hover effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/About.tsx": "About page displaying Glorious Cyber School's mission, vision, CBSE approach, and contact information with icons and statistics in a grid layout.",
  "frontend/src/pages/CourseDetail.tsx": "Course detail page that fetches and displays comprehensive information about a specific course by ID, including subject icon, grade level, difficulty, and enrollment options for authenticated users.",
  "frontend/src/pages/Courses.tsx": "Courses listing page with grade-level filtering using a dropdown selector, displaying courses in a grid layout with loading and empty states.",
  "frontend/src/pages/Dashboard.tsx": "Protected dashboard page showing authenticated user's profile, enrolled courses, and payment history with loading states and authentication redirect.",
  "frontend/src/pages/Enrollment.tsx": "Student enrollment page with form to select grade level (1-12) and course (Mathematics, Science, English, Hindi, Social Studies), requiring authentication and displaying user profile name from backend.",
  "frontend/src/pages/FeePayment.tsx": "Fee payment page allowing enrolled students to initiate monthly (₹500) or annual (₹4800) payments, showing savings calculation and payment confirmation with generated payment ID.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section, three feature cards (CBSE Curriculum, Expert Teachers, Quality Education), and featured courses section showcasing the K12 education platform.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both query strings and hash-based routing, with sessionStorage support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extending colors (using OKLCH color space), fonts (Inter, Poppins), animations (accordion, fade-in), and including typography, container queries, and animate plugins.",
  "project_state.json": "Project metadata documenting the K12 CBSE education platform rebuild from Google Sites, including architectural notes (domain, subjects, contact info, fee structure) and completed features list."
}